gcs92/fire_f11/Drivers/FM33LE0xx_FL_Driver/Inc/fm33le0xx_fl_opa.h
/**
  *******************************************************************************************************
  * @file    fm33le0xx_fl_opa.h
  * @author  FMSH Application Team
  * @brief   Head file of OPA FL Module
  *******************************************************************************************************
  * @attention
  *
  * Copyright (c) [2021] [Fudan Microelectronics]
  * THIS SOFTWARE is licensed under Mulan PSL v2.
  * You can use this software according to the terms and conditions of the Mulan PSL v2.
  * You may obtain a copy of Mulan PSL v2 at:
  *          http://license.coscl.org.cn/MulanPSL2
  * THIS SOFTWARE IS PROVIDED ON AN "AS IS" BASIS, WITHOUT WARRANTIES OF ANY KIND,
  * EITHER EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO NON-INFRINGEMENT,
  * MERCHANTABILITY OR FIT FOR A PARTICULAR PURPOSE.
  * See the Mulan PSL v2 for more details.
  *
  *******************************************************************************************************
  */


/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33LE0XX_FL_OPA_H
#define __FM33LE0XX_FL_OPA_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "fm33le0xx_fl_def.h"
/** @addtogroup FM33LE0XX_FL_Driver
  * @{
  */

/** @defgroup OPA OPA
  * @brief OPA FL driver
  * @{
  */

/* Exported types -------------------------------------------------------------------------------------*/
/** @defgroup OPA_FL_ES_INIT OPA Exported Init structures
  * @{
  */

/**
  * @brief OPA Init Sturcture definition
  */
typedef struct
{
    /** 正向输入选择 */
    uint32_t INP;

    /** 反向输入选择*/
    uint32_t INN;

    /** OPA 工作模式*/
    uint32_t mode;

    /** 数字滤波器使能 */
    uint32_t digitalFilter;

    /** PGA反向输入到选择由Pin输入 */
    uint32_t negtiveToPin;

    /** PGA模式下的放大倍数*/
    uint32_t gain;

    /** 低功耗模式使能 */
    uint32_t lowPowermode;

} FL_OPA_InitTypeDef;

/**
  * @}
  */

/* Exported constants ---------------------------------------------------------------------------------*/
/** @defgroup OPA_FL_Exported_Constants OPA Exported Constants
  * @{
  */

#define    OPA_CR_BUFFEN_Pos                                      (31U)
#define    OPA_CR_BUFFEN_Msk                                      (0x1U << OPA_CR_BUFFEN_Pos)
#define    OPA_CR_BUFFEN                                          OPA_CR_BUFFEN_Msk

#define    OPA_CR_BUFBYP_Pos                                      (30U)
#define    OPA_CR_BUFBYP_Msk                                      (0x1U << OPA_CR_BUFBYP_Pos)
#define    OPA_CR_BUFBYP                                          OPA_CR_BUFBYP_Msk

#define    OPA_CR_VNSEL_Pos                                       (9U)
#define    OPA_CR_VNSEL_Msk                                       (0x7U << OPA_CR_VNSEL_Pos)
#define    OPA_CR_VNSEL                                           OPA_CR_VNSEL_Msk

#define    OPA_CR_VPSEL_Pos                                       (8U)
#define    OPA_CR_VPSEL_Msk                                       (0x1U << OPA_CR_VPSEL_Pos)
#define    OPA_CR_VPSEL                                           OPA_CR_VPSEL_Msk

#define    OPA_CR_DF_Pos                                          (7U)
#define    OPA_CR_DF_Msk                                          (0x1U << OPA_CR_DF_Pos)
#define    OPA_CR_DF                                              OPA_CR_DF_Msk

#define    OPA_CR_VN_EXC_Pos                                      (6U)
#define    OPA_CR_VN_EXC_Msk                                      (0x1U << OPA_CR_VN_EXC_Pos)
#define    OPA_CR_VN_EXC                                          OPA_CR_VN_EXC_Msk

#define    OPA_CR_PGA_GAIN_Pos                                    (4U)
#define    OPA_CR_PGA_GAIN_Msk                                    (0x3U << OPA_CR_PGA_GAIN_Pos)
#define    OPA_CR_PGA_GAIN                                        OPA_CR_PGA_GAIN_Msk

#define    OPA_CR_MOD_Pos                                         (2U)
#define    OPA_CR_MOD_Msk                                         (0x3U << OPA_CR_MOD_Pos)
#define    OPA_CR_MOD                                             OPA_CR_MOD_Msk

#define    OPA_CR_LPM_Pos                                         (1U)
#define    OPA_CR_LPM_Msk                                         (0x1U << OPA_CR_LPM_Pos)
#define    OPA_CR_LPM                                             OPA_CR_LPM_Msk

#define    OPA_CR_EN_Pos                                          (0U)
#define    OPA_CR_EN_Msk                                          (0x1U << OPA_CR_EN_Pos)
#define    OPA_CR_EN                                              OPA_CR_EN_Msk

#define    OPA_CALR_NCAL_EN_Pos                                   (31U)
#define    OPA_CALR_NCAL_EN_Msk                                   (0x1U << OPA_CALR_NCAL_EN_Pos)
#define    OPA_CALR_NCAL_EN                                       OPA_CALR_NCAL_EN_Msk

#define    OPA_CALR_NCAL_Pos                                      (16U)
#define    OPA_CALR_NCAL_Msk                                      (0x1fU << OPA_CALR_NCAL_Pos)
#define    OPA_CALR_NCAL                                          OPA_CALR_NCAL_Msk

#define    OPA_CALR_PCAL_EN_Pos                                   (15U)
#define    OPA_CALR_PCAL_EN_Msk                                   (0x1U << OPA_CALR_PCAL_EN_Pos)
#define    OPA_CALR_PCAL_EN                                       OPA_CALR_PCAL_EN_Msk

#define    OPA_CALR_PCAL_Pos                                      (0U)
#define    OPA_CALR_PCAL_Msk                                      (0x1fU << OPA_CALR_PCAL_Pos)
#define    OPA_CALR_PCAL                                          OPA_CALR_PCAL_Msk

#define    OPA_IER_FIE_Pos                                        (1U)
#define    OPA_IER_FIE_Msk                                        (0x1U << OPA_IER_FIE_Pos)
#define    OPA_IER_FIE                                            OPA_IER_FIE_Msk

#define    OPA_IER_RIE_Pos                                        (0U)
#define    OPA_IER_RIE_Msk                                        (0x1U << OPA_IER_RIE_Pos)
#define    OPA_IER_RIE                                            OPA_IER_RIE_Msk

#define    OPA_ISR_OUT_Pos                                        (15U)
#define    OPA_ISR_OUT_Msk                                        (0x1U << OPA_ISR_OUT_Pos)
#define    OPA_ISR_OUT                                            OPA_ISR_OUT_Msk

